Revit 2027 API
ImporterIFCUtils.CreateEmptyFamily Method
 Creates an empty family of a given category.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateEmptyFamily(
	ImporterIFC importerIFC,
	Document aDoc,
	ElementId catId,
	string familyName
)
Public Shared Function CreateEmptyFamily (
	importerIFC As ImporterIFC,
	aDoc As Document,
	catId As ElementId,
	familyName As String
) As ElementId
public:
static ElementId^ CreateEmptyFamily(
	ImporterIFC^ importerIFC,
	Document^ aDoc,
	ElementId^ catId,
	String^ familyName
)
static member CreateEmptyFamily :
        importerIFC : ImporterIFC *
        aDoc : Document *
        catId : ElementId *
        familyName : string -> ElementId
Parameters
importerIFC ImporterIFC
 The importer.
aDoc Document
 The document to create the family.
catId ElementId
 The category id.
familyName String
 The family name.
Return Value
ElementId
 The created family id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace